{
  "pharaohs": [
    {
      "id": 1,
      "name": "Tutankhamun",
      "birthName": "Tutankhaten",
      "dynasty": "18th Dynasty, New Kingdom Egypt",
      "years": "-1332 BC : -1323 BC",
      "description": "Known as the boy king, famous for his nearly intact tomb discovered in 1922",
      "image": "https://marwan-mekhamer12.github.io/egyptian-civilization-api/images/King%20Tutankhamun.jpg",
      "family": {
        "parents": "Father most likely Akhenaten; mother 'Younger Lady', full sister of Akhenaten (grandparents Amenhotep III and Tiye).",
        "spouse": "Ankhesenamun (daughter of Akhenaten and Nefertiti).",
        "children": "Two stillborn daughters (317a and 317b) found in his tomb; no surviving children."
      },
      "biography": {
        "earlyLife": "Born around 1341 BCE during the Amarna Period.",
        "ascension": "Became pharaoh at about 9 years old. Advisers Ay and Horemheb held major power.",
        "religionPolitics": "Restored worship of Amun and traditional gods, abandoned Amarna capital, re-established old priesthoods.",
        "buildingProjects": "Small-scale restorations in temples such as Luxor; reign too short for major works."
      },
      "military": {
        "actions": "Evidence of campaigns in Nubia and Near East; mostly minor or defensive.",
        "personalInvolvement": "Unclear due to youth and health problems."
      },
      "healthAndDeath": {
        "healthIssues": [
          "Clubfoot limiting mobility",
          "Other skeletal/genetic issues",
          "Malaria infections"
        ],
        "deathTheories": [
          "Complications from malaria and frailty",
          "Chariot accident leading to infection",
          "Murder/foul play (debated)"
        ],
        "ageAtDeath": 18
      },
      "storyLegend": {
        "discovery": "Tomb KV62 found nearly intact in 1922 by Howard Carter.",
        "curseMyth": "Rumors of 'pharaoh's curse' after Lord Carnarvon’s death, but not supported by evidence.",
        "legacy": "His golden mask became a global icon; exhibitions spread fascination worldwide."
      },
      "burial": {
        "tomb": "KV62 in the Valley of the Kings",
        "notes": "Small and hastily prepared; some objects repurposed.",
        "burialGoods": "Thousands of items including golden mask, coffins, jewelry, chariots, furniture."
      }
    },
    {
      "id": 2,
      "name": "Ramses II",
      "birthName": "Ra-messu Meryamun",
      "dynasty": "19th Dynasty, New Kingdom Egypt",
      "years": "-1279 BC : -1213 BC",
      "description": "Ramses II, also called Ramses the Great, was one of the most powerful and celebrated pharaohs of ancient Egypt. He expanded Egypt’s empire, signed the world’s first known peace treaty, and left behind monumental constructions.",
      "image": "https://marwan-mekhamer12.github.io/egyptian-civilization-api/images/King%20Ramses%20II.jpg",
      "family": {
        "parents": "Father: Seti I; Mother: Queen Tuya.",
        "spouse": "Numerous wives, most famous: Nefertari (Great Royal Wife), Isetnofret, Maathorneferure (a Hittite princess).",
        "children": "Over 100 children; notable sons: Amun-her-khepeshef, Khaemweset (famous for restoring monuments), and Merneptah (his successor)."
      },
      "biography": {
        "earlyLife": "Born c. 1303 BCE, prepared from youth to succeed his father Seti I. Received military training and accompanied campaigns as a prince.",
        "ascension": "Became pharaoh around age 25, ruling for 66 years — one of the longest reigns in Egyptian history.",
        "religionPolitics": "Promoted the cult of Ra and Amun, portrayed himself as divine. Reinforced Egypt’s wealth through diplomacy and military campaigns.",
        "buildingProjects": "Constructed massive temples, cities, and monuments: Abu Simbel, Ramesseum, Pi-Ramesses (new capital). His cartouches appear throughout Egypt."
      },
      "military": {
        "actions": "Led campaigns into Canaan, Syria, and Nubia. Defended Egypt against the Hittites at the Battle of Kadesh (c. 1274 BCE).",
        "personalInvolvement": "Portrayed as heroic warrior; inscriptions depict him single-handedly turning the tide at Kadesh, though this is propagandistic.",
        "legacy": "Signed the first known international peace treaty with the Hittites after decades of conflict."
      },
      "healthAndDeath": {
        "healthIssues": [
          "Arthritis in old age",
          "Dental problems",
          "Possible hardening of arteries (arteriosclerosis)"
        ],
        "deathTheories": [
          "Natural causes, likely heart failure or old age complications"
        ],
        "ageAtDeath": 90
      },
      "storyLegend": {
        "fame": "Remembered by later Egyptians as a model of kingship; possibly inspired the figure of Pharaoh in the Biblical Exodus story.",
        "discovery": "Mummy discovered in 1881 at Deir el-Bahari cache (TT320).",
        "legacy": "Nicknamed 'Ramses the Great'; his monuments still dominate the Egyptian landscape."
      },
      "burial": {
        "tomb": "KV7 in the Valley of the Kings (heavily damaged by floods).",
        "notes": "His mummy was moved to the royal cache at Deir el-Bahari for protection.",
        "burialGoods": "Most original treasures lost to tomb robbers; some fragments remain."
      }
    },
    {
      "id": 3,
      "name": "Seti I",
      "birthName": "Menmaatre Seti",
      "dynasty": "19th Dynasty, New Kingdom Egypt",
      "years": "-1290 BC : -1279 BC",
      "description": "Seti I was the father of Ramses II and one of the most important warrior pharaohs of the New Kingdom. He reestablished Egyptian authority abroad and began the monumental works later completed by his son.",
      "image": "https://raw.githubusercontent.com/Marwan-Mekhamer12/egyptian-civilization-api/main/images/Seti%20I.jpg",
      "family": {
        "parents": "Father: Ramses I; Mother: Queen Sitre.",
        "spouse": "Queen Tuya.",
        "children": "Ramses II (his famous successor), Henutmire, Tia, and possibly others."
      },
      "biography": {
        "earlyLife": "Born c. 1310 BCE into a military family. His father Ramses I founded the 19th Dynasty but ruled briefly.",
        "ascension": "Succeeded his father after a short reign, consolidating power and stabilizing the dynasty.",
        "religionPolitics": "Restored temples desecrated during the Amarna period, reinforced worship of Amun and traditional gods.",
        "buildingProjects": "Constructed the magnificent Temple of Abydos, decorated with the famous 'Abydos King List.' Extended the Karnak temple and began works in the Valley of the Kings."
      },
      "military": {
        "actions": "Led major campaigns into Syria, Canaan, and Libya. Defeated Hittite forces and reasserted Egyptian control over lost territories.",
        "personalInvolvement": "Known as an active warrior-king, often depicted leading troops into battle.",
        "legacy": "Prepared the way for Ramses II’s later dominance in international affairs."
      },
      "healthAndDeath": {
        "healthIssues": [
          "No major records; likely relatively healthy"
        ],
        "deathTheories": [
          "Natural causes, possibly sudden illness"
        ],
        "ageAtDeath": 40
      },
      "storyLegend": {
        "fame": "Respected as one of Egypt’s greatest warrior-kings before Ramses II.",
        "discovery": "His mummy was found in the royal cache at Deir el-Bahari (TT320).",
        "legacy": "Best remembered for the Abydos Temple inscriptions, including the King List — crucial for modern Egyptology."
      },
      "burial": {
        "tomb": "KV17 (Valley of the Kings) — one of the longest and most beautifully decorated tombs.",
        "notes": "The tomb’s wall paintings are remarkably preserved and considered masterpieces of New Kingdom art.",
        "burialGoods": "Most treasures were looted in antiquity, but fragments remain."
      }
    }
  ]
}
